INSERT INTO ДОЛЖНОСТЬ ("ИДЕНТИФИКАТОР", "НАЗВАНИЕ", "РАБОЧЕЕ ВРЕМЯ ЗА ДЕНЬ", "ПЛАТА ЗА ЧАС")
VALUES (1, 'Работяга', 8,   300),
       (2, 'Dangeon master', 8,   300),
       (3, 'Slave', 12,   10),
       (4, 'Cleaner', 6, 150);

INSERT INTO КЛИЕНТ ("ИДЕНТИФИКАТОР", "ИМЯ", "ФАМИЛИЯ", "ОТЧЕСТВО", "ТЕЛЕФОН", "ПАССПОРТ, СЕРИЯ", "ПАССПОРТ, НОМЕР")
VALUES (1, 'Van', 'Darkholme',   'Leathermenovich', 89875491337, 2004, 020202),
       (2, 'Billy', 'Herrington', 'Gymovich',   89281337822, 1337, 456576),
       (3, 'Tyrone', 'Phillips', 'Arron', 78213521252, 5121, 213567),
       (4, 'George', 'Dawson', 'Martin', 61236121231, 6121, 213561);

INSERT INTO АБОНЕМЕНТ ("ИДЕНТИФИКАТОР", "ЦЕНА", "ПРОДОЛЖИТЕЛЬНОСТЬ, мес", "НАЗВАНИЕ", "РАЗРЕШЕННЫЕ АКТИВНОСТИ")
VALUES (1, 300, 9, 'We we', '{Качалка}'),
       (2, 500, 12, 'Годовой', '{Бассейн, Фитнесс зал, Тренажерный зал}');

INSERT INTO РАБОТНИК ("ИДЕНТИФИКАТОР", "ДОЛЖНОСТЬ", "ИМЯ", "ФАМИЛИЯ", "ОТЧЕСТВО", "ТЕЛЕФОН")
VALUES (1, 2, 'Brian', 'Maxon', 'Dungeon', 89257654785),
       (2, 1, 'Ricardo', 'Millos', 'Junior', 87654672434);

INSERT INTO ДОГОВОР ("ИДЕНТИФИКАТОР", "КЛИЕНТ", "АБОНЕМЕНТ", "НАЧАЛО ДЕЙСТВИЯ", "КОНЕЦ ДЕЙСТВИЯ", "СКИДКА, %")
VALUES (1, 1, 1, '2018-01-1', '2018-10-1', 0),
       (2, 2, 1, '2018-02-2', '2018-11-2', 0);

INSERT INTO РАСПИСАНИЕ ("ИДЕНТИФИКАТОР", "ТРЕНЕР", "АКТИВНОСТЬ", "ЗАЛ", "НАЧАЛО", "КОНЕЦ")
VALUES (1, 1, 'PowerLifting', 'Тренажерный зал', '2018-03-2 19:10:25', '2018-03-2 21:10:25');

INSERT INTO АКЦИИ ("ИДЕНТИФИКАТОР АБОНЕМЕНТА", "РАЗМЕР СКИДКИ, %", "НАЧАЛО АКЦИИ", "КОНЕЦ АКЦИИ", "НОВАЯ СТОИМОСТЬ")
VALUES (1, 20, '2018-03-2', '2018-12-2', 240);

