CREATE TABLE НАНИМАТЕЛЬ
(
    ИДЕНТИФИКАТОР           SERIAL          PRIMARY KEY,
    НАЗВАНИЕ                VARCHAR(64)     NOT NULL,
    "МЕСТО РАСПОЛОЖЕНИЯ"    VARCHAR(100)    NOT NULL,
    "ЛЬГОТА, %"             SMALLINT        NOT NULL,
    CHECK ("ЛЬГОТА, %" >= 0 AND "ЛЬГОТА, %" <= 100)
);

CREATE TABLE "БЮРО НАЙМА"
(
    ИДЕНТИФИКАТОР           SERIAL          PRIMARY KEY,
    НОМЕР                   VARCHAR(5)      NOT NULL,
    "АДРЕС КОНТОРЫ"         VARCHAR(100)    NOT NULL,
    "ПЛАТА ЗА УСЛУГИ, %"    SMALLINT        NOT NULL,
    CHECK ("ПЛАТА ЗА УСЛУГИ, %" >= 0 AND "ПЛАТА ЗА УСЛУГИ, %" <= 100)
);

CREATE TABLE ПРОФЕССИИ
(
    ИДЕНТИФИКАТОР           SERIAL          PRIMARY KEY,
    НАЗВАНИЕ                VARCHAR(30)     NOT NULL,
    "СТОИМОСТЬ НАЙМА, РУБ"  INT             NOT NULL,
    КОЛИЧЕСТВО              SMALLINT        NOT NULL,
    "МЕСТО ПРЕЖНЕЙ РАБОТЫ"  VARCHAR(100),
    CHECK ("СТОИМОСТЬ НАЙМА, РУБ" > 0 AND "КОЛИЧЕСТВО" > 0)
);

CREATE TABLE "ТРУДОВОЙ ДОГОВОР"
(
    "НОМЕР ДОГОВОРА"        SERIAL          PRIMARY KEY,
    ДАТА                    VARCHAR(10)     NOT NULL,
    НАНИМАТЕЛЬ              SERIAL          NOT NULL REFERENCES НАНИМАТЕЛЬ (ИДЕНТИФИКАТОР),
    "БЮРО НАЙМА"            SERIAL          NOT NULL REFERENCES "БЮРО НАЙМА" (ИДЕНТИФИКАТОР),
    ПРОФЕССИЯ               SERIAL          NOT NULL REFERENCES ПРОФЕССИИ (ИДЕНТИФИКАТОР),
    "КОЛИЧЕСТВО ВАКАНСИЙ"   SMALLINT        NOT NULL,
    "ОПЛАТА, РУБ"           INT             NOT NULL,
    CHECK ("КОЛИЧЕСТВО ВАКАНСИЙ" > 0 AND "ОПЛАТА, РУБ" > 0)
);

INSERT INTO "НАНИМАТЕЛЬ" ("ИДЕНТИФИКАТОР", "НАЗВАНИЕ", "МЕСТО РАСПОЛОЖЕНИЯ", "ЛЬГОТА, %")
VALUES (001, 'Рога и копыта',            'Приморск',    0),
       (002, 'ГАЗ',                      'Н. Новгород', 20),
       (003, 'Станкостроительный завод', 'Одесса',      2),
       (004, 'КИНАП',                    'Одесса',      2),
       (005, 'КРАЗ',                     'Кременчук',   2),
       (006, 'п\я 12687-у',              'Саранск',     10);

INSERT INTO "БЮРО НАЙМА" ("ИДЕНТИФИКАТОР", "НОМЕР", "АДРЕС КОНТОРЫ", "ПЛАТА ЗА УСЛУГИ, %")
VALUES (001, 'N5',  'Н. Новгород',   4),
       (002, 'N4',  'Москва',        3),
       (003, 'N12', 'Киев',          11),
       (004, 'N6',  'Н. Новгород',   3),
       (005, 'N8',  'Одесса',        9);

INSERT INTO "ПРОФЕССИИ" ("ИДЕНТИФИКАТОР", "НАЗВАНИЕ", "СТОИМОСТЬ НАЙМА, РУБ", "КОЛИЧЕСТВО", "МЕСТО ПРЕЖНЕЙ РАБОТЫ")
VALUES (001, 'Кровельщик',   10000, 7,  'Саранск'),
       (002, 'Слесарь',      15000, 6,  'Кременчуг'),
       (003, 'Счетовод',     25000, 10, 'Москва'),
       (004, 'Фрезеровщик',  20000, 7,  'Одесса'),
       (005, 'Программист',  40000, 8,  'Киев'),
       (006, 'Автоводитель', 25000, 3,  'Приморск'),
       (007, 'Шлифовальщик', 17000, 5,  'Одесса');

INSERT INTO "ТРУДОВОЙ ДОГОВОР" ("НОМЕР ДОГОВОРА", "ДАТА", "НАНИМАТЕЛЬ", "БЮРО НАЙМА", "ПРОФЕССИЯ", "КОЛИЧЕСТВО ВАКАНСИЙ", "ОПЛАТА, РУБ")
VALUES  (00127,     'Январь',   003,    004,    006,    1,  25000),
        (00128,     'Февраль',  006,    002,    001,    2,  20000),
        (00129,     'Март',     001,    003,    004,    1,  20000),
        (00130,     'Апрель',   002,    001,    007,    2,  34000),
        (00131,     'Апрель',   004,    004,    006,    1,  25000),
        (00132,     'Апрель',   006,    004,    001,    1,  10000),
        (00133,     'Май',      005,    002,    005,    3,  120000),
        (00134,     'Май',      003,    003,    002,    3,  45000),
        (00135,     'Май',      003,    004,    001,    1,  10000),
        (00136,     'Июнь',     004,    001,    003,    4,  100000),
        (00137,     'Июнь',     001,    002,    002,    3,  45000),
        (00138,     'Июнь',     001,    003,    007,    1,  17000),
        (00139,     'Июнь',     005,    004,    001,    2,  20000),
        (00140,     'Июнь',     003,    005,    002,    1,  15000),
        (00141,     'Июнь',     003,    005,    002,    1,  15000),
        (00142,     'Июнь',     004,    002,    006,    1,  25000),
        (00143,     'Сентябрь', 002,    002,    007,    2,  34000);
